7767517
787 1106   
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_input1         1 81 in1 mask_3d_btd_splitncnn_0 mask_3d_btd_splitncnn_1 mask_3d_btd_splitncnn_2 mask_3d_btd_splitncnn_3 mask_3d_btd_splitncnn_4 mask_3d_btd_splitncnn_5 mask_3d_btd_splitncnn_6 mask_3d_btd_splitncnn_7 mask_3d_btd_splitncnn_8 mask_3d_btd_splitncnn_9 mask_3d_btd_splitncnn_10 mask_3d_btd_splitncnn_11 mask_3d_btd_splitncnn_12 mask_3d_btd_splitncnn_13 mask_3d_btd_splitncnn_14 mask_3d_btd_splitncnn_15 mask_3d_btd_splitncnn_16 mask_3d_btd_splitncnn_17 mask_3d_btd_splitncnn_18 mask_3d_btd_splitncnn_19 mask_3d_btd_splitncnn_20 mask_3d_btd_splitncnn_21 mask_3d_btd_splitncnn_22 mask_3d_btd_splitncnn_23 mask_3d_btd_splitncnn_24 mask_3d_btd_splitncnn_25 mask_3d_btd_splitncnn_26 mask_3d_btd_splitncnn_27 mask_3d_btd_splitncnn_28 mask_3d_btd_splitncnn_29 mask_3d_btd_splitncnn_30 mask_3d_btd_splitncnn_31 mask_3d_btd_splitncnn_32 mask_3d_btd_splitncnn_33 mask_3d_btd_splitncnn_34 mask_3d_btd_splitncnn_35 mask_3d_btd_splitncnn_36 mask_3d_btd_splitncnn_37 mask_3d_btd_splitncnn_38 mask_3d_btd_splitncnn_39 mask_3d_btd_splitncnn_40 mask_3d_btd_splitncnn_41 mask_3d_btd_splitncnn_42 mask_3d_btd_splitncnn_43 mask_3d_btd_splitncnn_44 mask_3d_btd_splitncnn_45 mask_3d_btd_splitncnn_46 mask_3d_btd_splitncnn_47 mask_3d_btd_splitncnn_48 mask_3d_btd_splitncnn_49 mask_3d_btd_splitncnn_50 mask_3d_btd_splitncnn_51 mask_3d_btd_splitncnn_52 mask_3d_btd_splitncnn_53 mask_3d_btd_splitncnn_54 mask_3d_btd_splitncnn_55 mask_3d_btd_splitncnn_56 mask_3d_btd_splitncnn_57 mask_3d_btd_splitncnn_58 mask_3d_btd_splitncnn_59 mask_3d_btd_splitncnn_60 mask_3d_btd_splitncnn_61 mask_3d_btd_splitncnn_62 mask_3d_btd_splitncnn_63 mask_3d_btd_splitncnn_64 mask_3d_btd_splitncnn_65 mask_3d_btd_splitncnn_66 mask_3d_btd_splitncnn_67 mask_3d_btd_splitncnn_68 mask_3d_btd_splitncnn_69 mask_3d_btd_splitncnn_70 mask_3d_btd_splitncnn_71 mask_3d_btd_splitncnn_72 mask_3d_btd_splitncnn_73 mask_3d_btd_splitncnn_74 mask_3d_btd_splitncnn_75 mask_3d_btd_splitncnn_76 mask_3d_btd_splitncnn_77 mask_3d_btd_splitncnn_78 mask_3d_btd_splitncnn_79 mask_3d_btd_splitncnn_80
BinaryOp                 /encoder/Mul             1 1 in0 /encoder/Mul_output_0 0=2 1=1 2=2.262742e+01
PositionalEncoding       /pos_enc                 1 1 /encoder/Mul_output_0 /encoder/Mul_output_01 0=320
LayerNorm                /encoder/encoders0/encoders0.0/norm1/Add_1 1 1 /encoder/Mul_output_01 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0 0=560 1=1.000000e-12
Split                    splitncnn_0              1 4 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders0/encoders0.0/self_attn/linear_q/MatMul 1 1 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders0/encoders0.0/self_attn/linear_q/Add_output_0 0=320 1=1 2=179200
InnerProduct             /encoder/encoders0/encoders0.0/self_attn/linear_k/MatMul 1 1 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders0/encoders0.0/self_attn/linear_k/Add_output_0 0=320 1=1 2=179200
InnerProduct             /encoder/encoders0/encoders0.0/self_attn/linear_v/MatMul 1 1 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders0/encoders0.0/self_attn/linear_v/Add_output_0 0=320 1=1 2=179200
InnerProduct             /encoder/encoders0/encoders0.0/self_attn/linear_w/MatMul 1 1 /encoder/encoders0/encoders0.0/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders0/encoders0.0/self_attn/linear_w/Add_output_0 0=320 1=1 2=179200
BinaryOp                 /encoder/encoders0/encoders0.0/self_attn/Mul 1 1 /encoder/encoders0/encoders0.0/self_attn/linear_q/Add_output_0 /encoder/encoders0/encoders0.0/self_attn/Mul_output_0 0=2 1=1 2=1.118034e-01
Reshape                  /encoder/encoders0/encoders0.0/self_attn/Reshape 1 1 /encoder/encoders0/encoders0.0/self_attn/Mul_output_0 /encoder/encoders0/encoders0.0/self_attn/Reshape_output_0 0=80 1=4 2=-1
Permute                  /encoder/encoders0/encoders0.0/self_attn/Transpose 1 1 /encoder/encoders0/encoders0.0/self_attn/Reshape_output_0 /encoder/encoders0/encoders0.0/self_attn/Transpose_output_0 0=2
Reshape                  /encoder/encoders0/encoders0.0/self_attn/Reshape_1 1 1 /encoder/encoders0/encoders0.0/self_attn/linear_k/Add_output_0 /encoder/encoders0/encoders0.0/self_attn/Reshape_1_output_0 0=80 1=4 2=-1
Reshape                  /encoder/encoders0/encoders0.0/self_attn/Reshape_2 1 1 /encoder/encoders0/encoders0.0/self_attn/linear_v/Add_output_0 /encoder/encoders0/encoders0.0/self_attn/Reshape_2_output_0 0=80 1=4 2=-1
Permute                  /encoder/encoders0/encoders0.0/self_attn/Transpose_1 1 1 /encoder/encoders0/encoders0.0/self_attn/Reshape_2_output_0 /encoder/encoders0/encoders0.0/self_attn/Transpose_1_output_0 0=2
Permute                  /encoder/encoders0/encoders0.0/self_attn/Transpose_2 1 1 /encoder/encoders0/encoders0.0/self_attn/Reshape_1_output_0 /encoder/encoders0/encoders0.0/self_attn/Transpose_2_output_0 0=3
MatMul                   /encoder/encoders0/encoders0.0/self_attn/MatMul 2 1 /encoder/encoders0/encoders0.0/self_attn/Transpose_output_0 /encoder/encoders0/encoders0.0/self_attn/Transpose_2_output_0 /encoder/encoders0/encoders0.0/self_attn/MatMul_output_0
Softmax                  /encoder/encoders0/encoders0.0/self_attn/Softmax 1 1 /encoder/encoders0/encoders0.0/self_attn/MatMul_output_0 /encoder/encoders0/encoders0.0/self_attn/Softmax_output_0 0=-1 1=1
MatMul                   /encoder/encoders0/encoders0.0/self_attn/MatMul_1 2 1 /encoder/encoders0/encoders0.0/self_attn/Softmax_output_0 /encoder/encoders0/encoders0.0/self_attn/Transpose_1_output_0 /encoder/encoders0/encoders0.0/self_attn/MatMul_1_output_0
Permute                  /encoder/encoders0/encoders0.0/self_attn/Transpose_3 1 1 /encoder/encoders0/encoders0.0/self_attn/MatMul_1_output_0 /encoder/encoders0/encoders0.0/self_attn/Transpose_3_output_0 0=2
Reshape                  /encoder/encoders0/encoders0.0/self_attn/Reshape_3 1 1 /encoder/encoders0/encoders0.0/self_attn/Transpose_3_output_0 /encoder/encoders0/encoders0.0/self_attn/Reshape_3_output_0 0=320 1=-1
InnerProduct             /encoder/encoders0/encoders0.0/self_attn/linear_out/MatMul 1 1 /encoder/encoders0/encoders0.0/self_attn/Reshape_3_output_0 /encoder/encoders0/encoders0.0/self_attn/linear_out/Add_output_0 0=320 1=1 2=102400
BinaryOp                 /encoder/encoders0/encoders0.0/self_attn/Mul_1 2 1 /encoder/encoders0/encoders0.0/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_79 /encoder/encoders0/encoders0.0/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_1              1 2 /encoder/encoders0/encoders0.0/self_attn/Mul_1_output_0 /encoder/encoders0/encoders0.0/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders0/encoders0.0/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders0/encoders0.0/self_attn/Transpose_4 1 1 /encoder/encoders0/encoders0.0/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders0/encoders0.0/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders0/encoders0.0/self_attn/fsmn_block/Conv 1 1 /encoder/encoders0/encoders0.0/self_attn/Transpose_4_output_0 /encoder/encoders0/encoders0.0/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders0/encoders0.0/self_attn/Transpose_5 1 1 /encoder/encoders0/encoders0.0/self_attn/fsmn_block/Conv_output_0 /encoder/encoders0/encoders0.0/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders0/encoders0.0/self_attn/Add 2 1 /encoder/encoders0/encoders0.0/self_attn/Transpose_5_output_0 /encoder/encoders0/encoders0.0/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders0/encoders0.0/self_attn/Add_output_0
BinaryOp                 /encoder/encoders0/encoders0.0/self_attn/Mul_2 2 1 /encoder/encoders0/encoders0.0/self_attn/Add_output_0 mask_3d_btd_splitncnn_78 /encoder/encoders0/encoders0.0/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders0/encoders0.0/self_attn/Add_1 2 1 /encoder/encoders0/encoders0.0/self_attn/linear_out/Add_output_0 /encoder/encoders0/encoders0.0/self_attn/Mul_2_output_0 /encoder/encoders0/encoders0.0/self_attn/Add_1_output_0
Split                    splitncnn_2              1 2 /encoder/encoders0/encoders0.0/self_attn/Add_1_output_0 /encoder/encoders0/encoders0.0/self_attn/Add_1_output_0_splitncnn_0 /encoder/encoders0/encoders0.0/self_attn/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders0/encoders0.0/norm2/Add_1 1 1 /encoder/encoders0/encoders0.0/self_attn/Add_1_output_0_splitncnn_1 /encoder/encoders0/encoders0.0/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders0/encoders0.0/feed_forward/w_1/MatMul 1 1 /encoder/encoders0/encoders0.0/norm2/Add_1_output_0 /encoder/encoders0/encoders0.0/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders0/encoders0.0/feed_forward/w_2/MatMul 1 1 /encoder/encoders0/encoders0.0/feed_forward/activation/Relu_output_0 /encoder/encoders0/encoders0.0/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders0/encoders0.0/Add 2 1 /encoder/encoders0/encoders0.0/feed_forward/w_2/Add_output_0 /encoder/encoders0/encoders0.0/self_attn/Add_1_output_0_splitncnn_0 /encoder/encoders0/encoders0.0/Add_output_0
Split                    splitncnn_3              1 2 /encoder/encoders0/encoders0.0/Add_output_0 /encoder/encoders0/encoders0.0/Add_output_0_splitncnn_0 /encoder/encoders0/encoders0.0/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.0/norm1/Add_1 1 1 /encoder/encoders0/encoders0.0/Add_output_0_splitncnn_1 /encoder/encoders/encoders.0/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_4              1 4 /encoder/encoders/encoders.0/norm1/Add_1_output_0 /encoder/encoders/encoders.0/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.0/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.0/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.0/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.0/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.0/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.0/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.0/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.0/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.0/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.0/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.0/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.0/self_attn/Mul_1 2 1 /encoder/encoders/encoders.0/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_77 /encoder/encoders/encoders.0/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_5              1 2 /encoder/encoders/encoders.0/self_attn/Mul_1_output_0 /encoder/encoders/encoders.0/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.0/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.0/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.0/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.0/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.0/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.0/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.0/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.0/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.0/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.0/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.0/self_attn/Add 2 1 /encoder/encoders/encoders.0/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.0/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.0/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.0/self_attn/Mul_2 2 1 /encoder/encoders/encoders.0/self_attn/Add_output_0 mask_3d_btd_splitncnn_76 /encoder/encoders/encoders.0/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.0/self_attn/Add_1 2 1 /encoder/encoders/encoders.0/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.0/self_attn/Mul_2_output_0 /encoder/encoders/encoders.0/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.0/Add 2 1 /encoder/encoders/encoders.0/self_attn/Add_1_output_0 /encoder/encoders0/encoders0.0/Add_output_0_splitncnn_0 /encoder/encoders/encoders.0/Add_output_0
Split                    splitncnn_6              1 2 /encoder/encoders/encoders.0/Add_output_0 /encoder/encoders/encoders.0/Add_output_0_splitncnn_0 /encoder/encoders/encoders.0/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.0/norm2/Add_1 1 1 /encoder/encoders/encoders.0/Add_output_0_splitncnn_1 /encoder/encoders/encoders.0/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.0/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.0/norm2/Add_1_output_0 /encoder/encoders/encoders.0/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.0/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.0/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.0/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.0/Add_1 2 1 /encoder/encoders/encoders.0/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.0/Add_output_0_splitncnn_0 /encoder/encoders/encoders.0/Add_1_output_0
Split                    splitncnn_7              1 2 /encoder/encoders/encoders.0/Add_1_output_0 /encoder/encoders/encoders.0/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.0/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.1/norm1/Add_1 1 1 /encoder/encoders/encoders.0/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.1/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_8              1 4 /encoder/encoders/encoders.1/norm1/Add_1_output_0 /encoder/encoders/encoders.1/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.1/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.1/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.1/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.1/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.1/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.1/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.1/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.1/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.1/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.1/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.1/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.1/self_attn/Mul_1 2 1 /encoder/encoders/encoders.1/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_75 /encoder/encoders/encoders.1/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_9              1 2 /encoder/encoders/encoders.1/self_attn/Mul_1_output_0 /encoder/encoders/encoders.1/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.1/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.1/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.1/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.1/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.1/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.1/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.1/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.1/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.1/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.1/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.1/self_attn/Add 2 1 /encoder/encoders/encoders.1/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.1/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.1/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.1/self_attn/Mul_2 2 1 /encoder/encoders/encoders.1/self_attn/Add_output_0 mask_3d_btd_splitncnn_74 /encoder/encoders/encoders.1/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.1/self_attn/Add_1 2 1 /encoder/encoders/encoders.1/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.1/self_attn/Mul_2_output_0 /encoder/encoders/encoders.1/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.1/Add 2 1 /encoder/encoders/encoders.1/self_attn/Add_1_output_0 /encoder/encoders/encoders.0/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.1/Add_output_0
Split                    splitncnn_10             1 2 /encoder/encoders/encoders.1/Add_output_0 /encoder/encoders/encoders.1/Add_output_0_splitncnn_0 /encoder/encoders/encoders.1/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.1/norm2/Add_1 1 1 /encoder/encoders/encoders.1/Add_output_0_splitncnn_1 /encoder/encoders/encoders.1/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.1/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.1/norm2/Add_1_output_0 /encoder/encoders/encoders.1/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.1/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.1/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.1/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.1/Add_1 2 1 /encoder/encoders/encoders.1/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.1/Add_output_0_splitncnn_0 /encoder/encoders/encoders.1/Add_1_output_0
Split                    splitncnn_11             1 2 /encoder/encoders/encoders.1/Add_1_output_0 /encoder/encoders/encoders.1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.1/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.2/norm1/Add_1 1 1 /encoder/encoders/encoders.1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.2/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_12             1 4 /encoder/encoders/encoders.2/norm1/Add_1_output_0 /encoder/encoders/encoders.2/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.2/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.2/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.2/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.2/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.2/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.2/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.2/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.2/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.2/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.2/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.2/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.2/self_attn/Mul_1 2 1 /encoder/encoders/encoders.2/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_73 /encoder/encoders/encoders.2/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_13             1 2 /encoder/encoders/encoders.2/self_attn/Mul_1_output_0 /encoder/encoders/encoders.2/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.2/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.2/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.2/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.2/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.2/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.2/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.2/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.2/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.2/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.2/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.2/self_attn/Add 2 1 /encoder/encoders/encoders.2/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.2/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.2/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.2/self_attn/Mul_2 2 1 /encoder/encoders/encoders.2/self_attn/Add_output_0 mask_3d_btd_splitncnn_72 /encoder/encoders/encoders.2/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.2/self_attn/Add_1 2 1 /encoder/encoders/encoders.2/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.2/self_attn/Mul_2_output_0 /encoder/encoders/encoders.2/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.2/Add 2 1 /encoder/encoders/encoders.2/self_attn/Add_1_output_0 /encoder/encoders/encoders.1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.2/Add_output_0
Split                    splitncnn_14             1 2 /encoder/encoders/encoders.2/Add_output_0 /encoder/encoders/encoders.2/Add_output_0_splitncnn_0 /encoder/encoders/encoders.2/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.2/norm2/Add_1 1 1 /encoder/encoders/encoders.2/Add_output_0_splitncnn_1 /encoder/encoders/encoders.2/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.2/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.2/norm2/Add_1_output_0 /encoder/encoders/encoders.2/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.2/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.2/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.2/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.2/Add_1 2 1 /encoder/encoders/encoders.2/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.2/Add_output_0_splitncnn_0 /encoder/encoders/encoders.2/Add_1_output_0
Split                    splitncnn_15             1 2 /encoder/encoders/encoders.2/Add_1_output_0 /encoder/encoders/encoders.2/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.2/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.3/norm1/Add_1 1 1 /encoder/encoders/encoders.2/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.3/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_16             1 4 /encoder/encoders/encoders.3/norm1/Add_1_output_0 /encoder/encoders/encoders.3/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.3/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.3/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.3/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.3/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.3/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.3/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.3/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.3/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.3/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.3/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.3/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.3/self_attn/Mul_1 2 1 /encoder/encoders/encoders.3/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_71 /encoder/encoders/encoders.3/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_17             1 2 /encoder/encoders/encoders.3/self_attn/Mul_1_output_0 /encoder/encoders/encoders.3/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.3/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.3/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.3/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.3/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.3/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.3/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.3/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.3/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.3/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.3/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.3/self_attn/Add 2 1 /encoder/encoders/encoders.3/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.3/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.3/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.3/self_attn/Mul_2 2 1 /encoder/encoders/encoders.3/self_attn/Add_output_0 mask_3d_btd_splitncnn_70 /encoder/encoders/encoders.3/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.3/self_attn/Add_1 2 1 /encoder/encoders/encoders.3/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.3/self_attn/Mul_2_output_0 /encoder/encoders/encoders.3/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.3/Add 2 1 /encoder/encoders/encoders.3/self_attn/Add_1_output_0 /encoder/encoders/encoders.2/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.3/Add_output_0
Split                    splitncnn_18             1 2 /encoder/encoders/encoders.3/Add_output_0 /encoder/encoders/encoders.3/Add_output_0_splitncnn_0 /encoder/encoders/encoders.3/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.3/norm2/Add_1 1 1 /encoder/encoders/encoders.3/Add_output_0_splitncnn_1 /encoder/encoders/encoders.3/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.3/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.3/norm2/Add_1_output_0 /encoder/encoders/encoders.3/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.3/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.3/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.3/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.3/Add_1 2 1 /encoder/encoders/encoders.3/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.3/Add_output_0_splitncnn_0 /encoder/encoders/encoders.3/Add_1_output_0
Split                    splitncnn_19             1 2 /encoder/encoders/encoders.3/Add_1_output_0 /encoder/encoders/encoders.3/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.3/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.4/norm1/Add_1 1 1 /encoder/encoders/encoders.3/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.4/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_20             1 4 /encoder/encoders/encoders.4/norm1/Add_1_output_0 /encoder/encoders/encoders.4/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.4/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.4/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.4/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.4/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.4/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.4/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.4/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.4/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.4/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.4/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.4/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.4/self_attn/Mul_1 2 1 /encoder/encoders/encoders.4/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_69 /encoder/encoders/encoders.4/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_21             1 2 /encoder/encoders/encoders.4/self_attn/Mul_1_output_0 /encoder/encoders/encoders.4/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.4/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.4/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.4/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.4/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.4/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.4/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.4/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.4/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.4/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.4/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.4/self_attn/Add 2 1 /encoder/encoders/encoders.4/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.4/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.4/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.4/self_attn/Mul_2 2 1 /encoder/encoders/encoders.4/self_attn/Add_output_0 mask_3d_btd_splitncnn_68 /encoder/encoders/encoders.4/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.4/self_attn/Add_1 2 1 /encoder/encoders/encoders.4/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.4/self_attn/Mul_2_output_0 /encoder/encoders/encoders.4/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.4/Add 2 1 /encoder/encoders/encoders.4/self_attn/Add_1_output_0 /encoder/encoders/encoders.3/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.4/Add_output_0
Split                    splitncnn_22             1 2 /encoder/encoders/encoders.4/Add_output_0 /encoder/encoders/encoders.4/Add_output_0_splitncnn_0 /encoder/encoders/encoders.4/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.4/norm2/Add_1 1 1 /encoder/encoders/encoders.4/Add_output_0_splitncnn_1 /encoder/encoders/encoders.4/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.4/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.4/norm2/Add_1_output_0 /encoder/encoders/encoders.4/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.4/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.4/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.4/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.4/Add_1 2 1 /encoder/encoders/encoders.4/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.4/Add_output_0_splitncnn_0 /encoder/encoders/encoders.4/Add_1_output_0
Split                    splitncnn_23             1 2 /encoder/encoders/encoders.4/Add_1_output_0 /encoder/encoders/encoders.4/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.4/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.5/norm1/Add_1 1 1 /encoder/encoders/encoders.4/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.5/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_24             1 4 /encoder/encoders/encoders.5/norm1/Add_1_output_0 /encoder/encoders/encoders.5/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.5/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.5/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.5/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.5/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.5/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.5/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.5/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.5/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.5/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.5/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.5/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.5/self_attn/Mul_1 2 1 /encoder/encoders/encoders.5/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_67 /encoder/encoders/encoders.5/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_25             1 2 /encoder/encoders/encoders.5/self_attn/Mul_1_output_0 /encoder/encoders/encoders.5/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.5/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.5/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.5/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.5/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.5/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.5/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.5/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.5/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.5/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.5/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.5/self_attn/Add 2 1 /encoder/encoders/encoders.5/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.5/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.5/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.5/self_attn/Mul_2 2 1 /encoder/encoders/encoders.5/self_attn/Add_output_0 mask_3d_btd_splitncnn_66 /encoder/encoders/encoders.5/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.5/self_attn/Add_1 2 1 /encoder/encoders/encoders.5/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.5/self_attn/Mul_2_output_0 /encoder/encoders/encoders.5/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.5/Add 2 1 /encoder/encoders/encoders.5/self_attn/Add_1_output_0 /encoder/encoders/encoders.4/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.5/Add_output_0
Split                    splitncnn_26             1 2 /encoder/encoders/encoders.5/Add_output_0 /encoder/encoders/encoders.5/Add_output_0_splitncnn_0 /encoder/encoders/encoders.5/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.5/norm2/Add_1 1 1 /encoder/encoders/encoders.5/Add_output_0_splitncnn_1 /encoder/encoders/encoders.5/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.5/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.5/norm2/Add_1_output_0 /encoder/encoders/encoders.5/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.5/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.5/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.5/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.5/Add_1 2 1 /encoder/encoders/encoders.5/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.5/Add_output_0_splitncnn_0 /encoder/encoders/encoders.5/Add_1_output_0
Split                    splitncnn_27             1 2 /encoder/encoders/encoders.5/Add_1_output_0 /encoder/encoders/encoders.5/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.5/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.6/norm1/Add_1 1 1 /encoder/encoders/encoders.5/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.6/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_28             1 4 /encoder/encoders/encoders.6/norm1/Add_1_output_0 /encoder/encoders/encoders.6/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.6/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.6/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.6/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.6/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.6/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.6/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.6/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.6/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.6/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.6/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.6/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.6/self_attn/Mul_1 2 1 /encoder/encoders/encoders.6/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_65 /encoder/encoders/encoders.6/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_29             1 2 /encoder/encoders/encoders.6/self_attn/Mul_1_output_0 /encoder/encoders/encoders.6/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.6/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.6/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.6/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.6/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.6/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.6/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.6/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.6/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.6/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.6/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.6/self_attn/Add 2 1 /encoder/encoders/encoders.6/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.6/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.6/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.6/self_attn/Mul_2 2 1 /encoder/encoders/encoders.6/self_attn/Add_output_0 mask_3d_btd_splitncnn_64 /encoder/encoders/encoders.6/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.6/self_attn/Add_1 2 1 /encoder/encoders/encoders.6/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.6/self_attn/Mul_2_output_0 /encoder/encoders/encoders.6/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.6/Add 2 1 /encoder/encoders/encoders.6/self_attn/Add_1_output_0 /encoder/encoders/encoders.5/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.6/Add_output_0
Split                    splitncnn_30             1 2 /encoder/encoders/encoders.6/Add_output_0 /encoder/encoders/encoders.6/Add_output_0_splitncnn_0 /encoder/encoders/encoders.6/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.6/norm2/Add_1 1 1 /encoder/encoders/encoders.6/Add_output_0_splitncnn_1 /encoder/encoders/encoders.6/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.6/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.6/norm2/Add_1_output_0 /encoder/encoders/encoders.6/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.6/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.6/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.6/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.6/Add_1 2 1 /encoder/encoders/encoders.6/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.6/Add_output_0_splitncnn_0 /encoder/encoders/encoders.6/Add_1_output_0
Split                    splitncnn_31             1 2 /encoder/encoders/encoders.6/Add_1_output_0 /encoder/encoders/encoders.6/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.6/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.7/norm1/Add_1 1 1 /encoder/encoders/encoders.6/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.7/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_32             1 4 /encoder/encoders/encoders.7/norm1/Add_1_output_0 /encoder/encoders/encoders.7/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.7/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.7/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.7/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.7/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.7/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.7/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.7/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.7/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.7/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.7/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.7/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.7/self_attn/Mul_1 2 1 /encoder/encoders/encoders.7/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_63 /encoder/encoders/encoders.7/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_33             1 2 /encoder/encoders/encoders.7/self_attn/Mul_1_output_0 /encoder/encoders/encoders.7/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.7/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.7/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.7/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.7/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.7/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.7/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.7/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.7/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.7/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.7/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.7/self_attn/Add 2 1 /encoder/encoders/encoders.7/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.7/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.7/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.7/self_attn/Mul_2 2 1 /encoder/encoders/encoders.7/self_attn/Add_output_0 mask_3d_btd_splitncnn_62 /encoder/encoders/encoders.7/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.7/self_attn/Add_1 2 1 /encoder/encoders/encoders.7/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.7/self_attn/Mul_2_output_0 /encoder/encoders/encoders.7/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.7/Add 2 1 /encoder/encoders/encoders.7/self_attn/Add_1_output_0 /encoder/encoders/encoders.6/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.7/Add_output_0
Split                    splitncnn_34             1 2 /encoder/encoders/encoders.7/Add_output_0 /encoder/encoders/encoders.7/Add_output_0_splitncnn_0 /encoder/encoders/encoders.7/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.7/norm2/Add_1 1 1 /encoder/encoders/encoders.7/Add_output_0_splitncnn_1 /encoder/encoders/encoders.7/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.7/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.7/norm2/Add_1_output_0 /encoder/encoders/encoders.7/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.7/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.7/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.7/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.7/Add_1 2 1 /encoder/encoders/encoders.7/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.7/Add_output_0_splitncnn_0 /encoder/encoders/encoders.7/Add_1_output_0
Split                    splitncnn_35             1 2 /encoder/encoders/encoders.7/Add_1_output_0 /encoder/encoders/encoders.7/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.7/Add_1_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.8/norm1/Add_1 1 1 /encoder/encoders/encoders.7/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.8/norm1/Add_1_output_0 0=320 1=1.000000e-12
Split                    splitncnn_36             1 4 /encoder/encoders/encoders.8/norm1/Add_1_output_0 /encoder/encoders/encoders.8/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.8/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.8/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.8/norm1/Add_1_output_0_splitncnn_3
InnerProduct             /encoder/encoders/encoders.8/self_attn/linear_w/MatMul 1 1 /encoder/encoders/encoders.8/norm1/Add_1_output_0_splitncnn_3 /encoder/encoders/encoders.8/self_attn/linear_w/Add_output_0 0=320 1=1 2=102400
MultiHeadAttention       /encoder/encoders/encoders.8/self_attn/linear_out/Add 3 1 /encoder/encoders/encoders.8/norm1/Add_1_output_0_splitncnn_2 /encoder/encoders/encoders.8/norm1/Add_1_output_0_splitncnn_1 /encoder/encoders/encoders.8/norm1/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.8/self_attn/linear_out/Add_output_0 0=320 1=4 2=102400 3=320 4=320
BinaryOp                 /encoder/encoders/encoders.8/self_attn/Mul_1 2 1 /encoder/encoders/encoders.8/self_attn/linear_w/Add_output_0 mask_3d_btd_splitncnn_61 /encoder/encoders/encoders.8/self_attn/Mul_1_output_0 0=2
Split                    splitncnn_37             1 2 /encoder/encoders/encoders.8/self_attn/Mul_1_output_0 /encoder/encoders/encoders.8/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.8/self_attn/Mul_1_output_0_splitncnn_1
Permute                  /encoder/encoders/encoders.8/self_attn/Transpose_4 1 1 /encoder/encoders/encoders.8/self_attn/Mul_1_output_0_splitncnn_1 /encoder/encoders/encoders.8/self_attn/Transpose_4_output_0 0=1
ConvolutionDepthWise1D   /encoder/encoders/encoders.8/self_attn/fsmn_block/Conv 1 1 /encoder/encoders/encoders.8/self_attn/Transpose_4_output_0 /encoder/encoders/encoders.8/self_attn/fsmn_block/Conv_output_0 0=320 1=11 4=5 6=3520 7=320
Permute                  /encoder/encoders/encoders.8/self_attn/Transpose_5 1 1 /encoder/encoders/encoders.8/self_attn/fsmn_block/Conv_output_0 /encoder/encoders/encoders.8/self_attn/Transpose_5_output_0 0=1
BinaryOp                 /encoder/encoders/encoders.8/self_attn/Add 2 1 /encoder/encoders/encoders.8/self_attn/Transpose_5_output_0 /encoder/encoders/encoders.8/self_attn/Mul_1_output_0_splitncnn_0 /encoder/encoders/encoders.8/self_attn/Add_output_0
BinaryOp                 /encoder/encoders/encoders.8/self_attn/Mul_2 2 1 /encoder/encoders/encoders.8/self_attn/Add_output_0 mask_3d_btd_splitncnn_60 /encoder/encoders/encoders.8/self_attn/Mul_2_output_0 0=2
BinaryOp                 /encoder/encoders/encoders.8/self_attn/Add_1 2 1 /encoder/encoders/encoders.8/self_attn/linear_out/Add_output_0 /encoder/encoders/encoders.8/self_attn/Mul_2_output_0 /encoder/encoders/encoders.8/self_attn/Add_1_output_0
BinaryOp                 /encoder/encoders/encoders.8/Add 2 1 /encoder/encoders/encoders.8/self_attn/Add_1_output_0 /encoder/encoders/encoders.7/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.8/Add_output_0
Split                    splitncnn_38             1 2 /encoder/encoders/encoders.8/Add_output_0 /encoder/encoders/encoders.8/Add_output_0_splitncnn_0 /encoder/encoders/encoders.8/Add_output_0_splitncnn_1
LayerNorm                /encoder/encoders/encoders.8/norm2/Add_1 1 1 /encoder/encoders/encoders.8/Add_output_0_splitncnn_1 /encoder/encoders/encoders.8/norm2/Add_1_output_0 0=320 1=1.000000e-12
InnerProduct             /encoder/encoders/encoders.8/feed_forward/w_1/MatMul 1 1 /encoder/encoders/encoders.8/norm2/Add_1_output_0 /encoder/encoders/encoders.8/feed_forward/activation/Relu_output_0 0=1280 1=1 2=409600 9=1
InnerProduct             /encoder/encoders/encoders.8/feed_forward/w_2/MatMul 1 1 /encoder/encoders/encoders.8/feed_forward/activation/Relu_output_0 /encoder/encoders/encoders.8/feed_forward/w_2/Add_output_0 0=320 1=1 2=409600
BinaryOp                 /encoder/encoders/encoders.8/Add_1 2 1 /encoder/encoders/encoders.8/feed_forward/w_2/Add_output_0 /encoder/encoders/encoders.8/Add_output_0_splitncnn_0 /encoder/encoders/encoders.8/Add_1_output_0
Split                    splitncnn_39             1 2 /encoder/encoders/encoders.8/Add_1_output_0 /encoder/encoders/encoders.8/Add_1_output_0_splitncnn_0 /encoder/encoders/encoders.8/Add_1_output_0_splitncnn_1
